In [65]:
import cartoleiro

cart = cartoleiro.Cartoleiro(True)
cart.scout_table.head(10)

,rodada_id,atleta_id,A,CA,CV,DD,DP,FC,FD,FF,...,SG,apelido,clube_id,jogos_num,media_num,pontos_num,posicao_id,preco_num,status_id,variacao_num
0,1,81091,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Jair,282,1,1.5,1.5,4,6.59,6,-1.41
1,1,80853,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Pedro Geromel,284,1,8.0,8.0,3,12.49,7,2.49
2,1,38509,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Diego Alves,262,0,0.0,0.0,1,5.00,5,0.00
3,1,86757,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,Everton,284,1,10.6,10.6,5,16.37,7,3.37
4,1,78445,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Renê,262,1,0.6,0.6,2,8.74,7,-3.26
5,1,42234,NaN,1.0,NaN,1.0,NaN,NaN,NaN,NaN,...,NaN,Cássio,264,1,-4.5,-4.5,1,5.20,7,-6.80
6,1,37656,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,...,NaN,Fábio,283,1,-3.0,-3.0,1,7.63,7,-6.37
7,1,87342,NaN,1.0,NaN,NaN,NaN,3.0,NaN,NaN,...,NaN,Kannemann,284,1,0.4,0.4,3,17.62,7,-7.38
8,1,42500,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,Fagner,264,1,3.4,3.4,2,5.83,7,0.83
9,1,60819,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,...,NaN,Dedé,283,1,0.4,0.4,3,14.15,7,-5.85

In [80]:
atletas = cart.scout_table[["rodada_id", "atleta_id", "apelido", "posicao_id", "pontos_num", "jogos_num"]]
atletas = atletas[atletas.pontos_num != 0]
atletas[["rodada_id", "pontos_num"]].describe()

         rodada_id   pontos_num
count  1088.000000  1088.000000
mean      2.505515     3.102518
std       1.120999     4.093716
min       1.000000    -9.000000
25%       1.750000     0.500000
50%       3.000000     2.100000
75%       4.000000     5.000000
max       4.000000    22.700000

In [81]:
atacantes = atletas[atletas.posicao_id == 5]
atacantes[["rodada_id", "pontos_num"]].describe()

        rodada_id  pontos_num
count  257.000000  257.000000
mean     2.556420    3.355253
std      1.120533    4.768621
min      1.000000   -9.000000
25%      2.000000    0.300000
50%      3.000000    1.900000
75%      4.000000    5.300000
max      4.000000   22.700000

In [82]:
goleiros = atletas[atletas.posicao_id == 1]
goleiros[["rodada_id", "pontos_num"]].describe()

       rodada_id  pontos_num
count  77.000000   77.000000
mean    2.480519    3.688312
std     1.131026    6.080858
min     1.000000   -6.600000
25%     1.000000   -1.300000
50%     2.000000    3.400000
75%     3.000000    7.700000
max     4.000000   21.000000

In [83]:
meias = atletas[atletas.posicao_id == 4]
meias[["rodada_id", "pontos_num"]].describe()

        rodada_id  pontos_num
count  374.000000  374.000000
mean     2.505348    2.753743
std      1.131429    3.562114
min      1.000000   -4.100000
25%      1.000000    0.500000
50%      2.500000    1.700000
75%      4.000000    4.200000
max      4.000000   19.400000

In [84]:
zagueiros = atletas[atletas.posicao_id == 2]
zagueiros[["rodada_id", "pontos_num"]].describe()

        rodada_id  pontos_num
count  151.000000  151.000000
mean     2.483444    3.360265
std      1.112680    4.144958
min      1.000000   -5.700000
25%      1.500000    0.100000
50%      2.000000    2.900000
75%      3.000000    5.650000
max      4.000000   17.400000

In [85]:
laterais = atletas[atletas.posicao_id == 3]
laterais[["rodada_id", "pontos_num"]].describe()

        rodada_id  pontos_num
count  154.000000  154.000000
mean     2.467532    2.674675
std      1.115364    3.509028
min      1.000000   -4.400000
25%      1.000000   -0.050000
50%      2.000000    2.000000
75%      3.000000    4.700000
max      4.000000   13.900000

In [79]:
geromel = atletas[atletas.atleta_id == 80853]
geromel = geromel.set_index(["atleta_id", "rodada_id"])
geromel["jogou"] = (geromel["jogos_num"].diff() != 0) & (geromel["jogos_num"] != 0)
geromel

                           apelido  posicao_id  pontos_num  jogos_num  jogou
atleta_id rodada_id
80853     1          Pedro Geromel           3         8.0          1   True
          2          Pedro Geromel           3         0.6          2   True
          3          Pedro Geromel           3         0.0          2  False
          4          Pedro Geromel           3         8.6          3   True

In [43]:
import numpy as np

atletas.pivot_table(index="atleta_id", values=["jogos_num"], aggfunc=np.sum)

           jogos_num
atleta_id
36540              1
36886             10
37246             10
37281             10
37333             10
37604              3
37646             10
37656             10
37662              7
37688             10
37694              6
37701              2
37717              0
37788              0
37792              2
37798              7
38001              4
38162             10
38196              6
38229             10
38231              7
38277             10
38279             10
38287              4
38311             10
38315              6
38394              7
38421              4
38431              0
38451              6
...              ...
104649             0
104650             0
104651             0
104660             0
104678             0
104819             9
104824             0
104991             0
104994             0
105046             0
105068             0
105111             0
105112             0
105173             0
105175             0
105176             0
105198             0
105199             0
105201             0
105208             0
105272             1
105278             0
105282             0
105395             0
105396             0
105397             0
105553             7
105566             0
105584             0
105585             0

[749 rows x 1 columns]